Tutorial : 2 - Explore Pandas library to analyze  and manipulate data.
Description: Use Pandas library for data analysis and manipulation.

Dataset: Sample CSV file

Task: Load the dataset, perform data cleaning, manipulation (like sorting, filtering), and exploratory data analysis.

- Pandas is a open source library for real world data analysis in python
- It is built on top of numpy.
- Using pandas data can be cleaned, transformed, manipulated, & analyzed.
- The basic data structures of pandas are Series and DataFrame.

1. Series object: Series is a one dimensional labelled array.
2. DataFrame: A DataFrame in pandas is two-dimensional tabular data structure.
- It consists of rows and columns represents different features.
- rows represents records or entries.
- index represents label of rows.

HW -
Q. Find difference b/w list, numpy array & pandas series

In [2]:
import numpy as np
import pandas as pd

In [5]:
l1 = [1,2,3,4,5]
arr1 = np.array([1,2,3,4,5])
s1 = pd.Series([1,2,3,4,5])

In [6]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
s2 = pd.Series([1,2,3,4,5], index=['A','B','C','D','E'])
s2

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [9]:
s2.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [10]:
s2.values

array([1, 2, 3, 4, 5], dtype=int64)

In [11]:
s2.index.dtype

dtype('O')

In [12]:
s2.values.dtype

dtype('int64')

In [13]:
data = [{'Name': 'Subodh', 'Marks': 28},
        {'Name': 'Aman', 'Marks': 25},
        {'Marks': 27},
        {'Name': 'ram', 'Marks': 21}
]
f1 = pd.DataFrame(data)
f1

     Name  Marks
0  Subodh     28
1    Aman     25
2     NaN     27
3     ram     21

In [14]:
type(f1)

pandas.core.frame.DataFrame

In [15]:
f1.isna()

    Name  Marks
0  False  False
1  False  False
2   True  False
3  False  False

In [16]:
f1.isna().sum()

Name     1
Marks    0
dtype: int64

In [17]:
df = pd.read_excel('student_details.xlsx')
df

     Name Branch Division
0  Prince     CE        A
1   Rahul     CV        A
2     Ram     IT        C
3  Subodh     CE        C
4    Aman     CE        B
5  Madhav     IT        A

In [18]:
iris = pd.read_csv('Iris.csv')
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [19]:
rows = iris.shape[0]
rows

150

In [20]:
cols = iris.shape[1]
cols

6

In [21]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [22]:
iris.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [23]:
iris.head(10)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
5   6            5.4           3.9            1.7           0.4  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa
9  10            4.9           3.1            1.5           0.1  Iris-setosa

In [24]:
iris.tail(10)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
140,141,6.7,3.1,5.6,2.4,Iris-virginica
141,142,6.9,3.1,5.1,2.3,Iris-virginica
142,143,5.8,2.7,5.1,1.9,Iris-virginica
143,144,6.8,3.2,5.9,2.3,Iris-virginica
144,145,6.7,3.3,5.7,2.5,Iris-virginica
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [25]:
iris.index

RangeIndex(start=0, stop=150, step=1)

In [26]:
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [27]:
iris.isna().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [28]:
iris['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [29]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [30]:
iris = iris.rename(columns = {'SepalLengthCm':'Sepal_Length','SepalWidthCm':'Sepal_Width','PetalLengthCm':'Petal_Length','PetalWidthCm':'Petal_Width'})

In [31]:
iris.columns

Index(['Id', 'Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width',
       'Species'],
      dtype='object')

In [32]:
iris

      Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width         Species
0      1           5.1          3.5           1.4          0.2     Iris-setosa
1      2           4.9          3.0           1.4          0.2     Iris-setosa
2      3           4.7          3.2           1.3          0.2     Iris-setosa
3      4           4.6          3.1           1.5          0.2     Iris-setosa
4      5           5.0          3.6           1.4          0.2     Iris-setosa
..   ...           ...          ...           ...          ...             ...
145  146           6.7          3.0           5.2          2.3  Iris-virginica
146  147           6.3          2.5           5.0          1.9  Iris-virginica
147  148           6.5          3.0           5.2          2.0  Iris-virginica
148  149           6.2          3.4           5.4          2.3  Iris-virginica
149  150           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 6 columns]

In [35]:
df.Species.unique()

AttributeError: 'DataFrame' object has no attribute 'Species'

In [36]:
iris.replace("Iris-setosa", "setosa", inplace= True)

In [37]:
iris.replace("Iris-versicolor", "versicolor", inplace= True)
iris.replace("Iris-virginica", "virginica", inplace= True)

In [38]:
iris.Species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [39]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            150 non-null    int64
 1   Sepal_Length  150 non-null    float64
 2   Sepal_Width   150 non-null    float64
 3   Petal_Length  150 non-null    float64
 4   Petal_Width   150 non-null    float64
 5   Species       150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [40]:
iris.describe()

               Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count  150.000000    150.000000   150.000000    150.000000   150.000000
mean    75.500000      5.843333     3.054000      3.758667     1.198667
std     43.445368      0.828066     0.433594      1.764420     0.763161
min      1.000000      4.300000     2.000000      1.000000     0.100000
25%     38.250000      5.100000     2.800000      1.600000     0.300000
50%     75.500000      5.800000     3.000000      4.350000     1.300000
75%    112.750000      6.400000     3.300000      5.100000     1.800000
max    150.000000      7.900000     4.400000      6.900000     2.500000

In [41]:
iris['Species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: Species, Length: 150, dtype: object

In [42]:
iris[['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width']]

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [43]:
def yes_no(Sepal_Length):
    return 'YES' if Sepal_Length >= 5 else 'No'
iris['Result'] = iris['Sepal_Length'].apply(yes_no)
iris

,Id,Sepal_Length,Sepal_Width,Petal_Length,Petal_Width,Species,Result
0,1,5.1,3.5,1.4,0.2,setosa,YES
1,2,4.9,3.0,1.4,0.2,setosa,No
2,3,4.7,3.2,1.3,0.2,setosa,No
3,4,4.6,3.1,1.5,0.2,setosa,No
4,5,5.0,3.6,1.4,0.2,setosa,YES
...,...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica,YES
146,147,6.3,2.5,5.0,1.9,virginica,YES
147,148,6.5,3.0,5.2,2.0,virginica,YES
148,149,6.2,3.4,5.4,2.3,virginica,YES
149,150,5.9,3.0,5.1,1.8,virginica,YES

In [44]:
iris.drop('Result', axis = 1, inplace= True)

In [46]:
iris

      Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0      1           5.1          3.5           1.4          0.2     setosa
1      2           4.9          3.0           1.4          0.2     setosa
2      3           4.7          3.2           1.3          0.2     setosa
3      4           4.6          3.1           1.5          0.2     setosa
4      5           5.0          3.6           1.4          0.2     setosa
..   ...           ...          ...           ...          ...        ...
145  146           6.7          3.0           5.2          2.3  virginica
146  147           6.3          2.5           5.0          1.9  virginica
147  148           6.5          3.0           5.2          2.0  virginica
148  149           6.2          3.4           5.4          2.3  virginica
149  150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

In [47]:
iris.head(1)

   Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0   1           5.1          3.5           1.4          0.2  setosa

- The iloc indexer is primarily used for integer location based indexing
allowing you to acess specific rows and columns by their numerical indexes

In [56]:
iris.iloc[0]

Id                   1
Sepal_Length       5.1
Sepal_Width        3.5
Petal_Length       1.4
Petal_Width        0.2
Species         setosa
Name: 0, dtype: object

In [49]:
iris.iloc[51:56]

    Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width     Species
51  52           6.4          3.2           4.5          1.5  versicolor
52  53           6.9          3.1           4.9          1.5  versicolor
53  54           5.5          2.3           4.0          1.3  versicolor
54  55           6.5          2.8           4.6          1.5  versicolor
55  56           5.7          2.8           4.5          1.3  versicolor

In [58]:
iris[(iris['Species'] == 'virginica') & (iris['Petal_Length'] > 6)]

      Id  Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
105  106           7.6          3.0           6.6          2.1  virginica
107  108           7.3          2.9           6.3          1.8  virginica
109  110           7.2          3.6           6.1          2.5  virginica
117  118           7.7          3.8           6.7          2.2  virginica
118  119           7.7          2.6           6.9          2.3  virginica
122  123           7.7          2.8           6.7          2.0  virginica
130  131           7.4          2.8           6.1          1.9  virginica
131  132           7.9          3.8           6.4          2.0  virginica
135  136           7.7          3.0           6.1          2.3  virginica

In [59]:
iris.duplicated().sum()

0

In [62]:
iris.isna().sum()

Id              0
Sepal_Length    0
Sepal_Width     0
Petal_Length    0
Petal_Width     0
Species         0
dtype: int64

In [66]:
student_info = pd.read_csv('student_info.csv')
student_info

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [67]:
student_info.shape

(200, 2)

In [68]:
student_info.columns

Index(['study_hours', 'student_marks'], dtype='object')

In [69]:
student_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   study_hours    195 non-null    float64
 1   student_marks  200 non-null    float64
dtypes: float64(2)
memory usage: 3.3 KB

In [70]:
student_info.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000

In [71]:
student_info.isna().sum()

study_hours      5
student_marks    0
dtype: int64

In [73]:
student_info['study_hours'].mean()

6.9959487179487185

In [75]:
student_info.study_hours.fillna(student_info['study_hours'].mean(), inplace= True)

In [76]:
student_info.isna().sum()

study_hours      0
student_marks    0
dtype: int64

In [7]:
adult_data = pd.read_csv('adult/adult_data.csv')
adult_data

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [8]:
adult_data.shape

(32560, 15)

In [12]:
adult_data.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [13]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32560 entries, 0 to 32559
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   39              32560 non-null  int64
 1    State-gov      32560 non-null  object
 2    77516          32560 non-null  int64
 3    Bachelors      32560 non-null  object
 4    13             32560 non-null  int64
 5    Never-married  32560 non-null  object
 6    Adm-clerical   32560 non-null  object
 7    Not-in-family  32560 non-null  object
 8    White          32560 non-null  object
 9    Male           32560 non-null  object
 10   2174           32560 non-null  int64
 11   0              32560 non-null  int64
 12   40             32560 non-null  int64
 13   United-States  32560 non-null  object
 14   <=50K          32560 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [10]:
adult_data.isna().sum()

39                0
 State-gov        0
 77516            0
 Bachelors        0
 13               0
 Never-married    0
 Adm-clerical     0
 Not-in-family    0
 White            0
 Male             0
 2174             0
 0                0
 40               0
 United-States    0
 <=50K            0
dtype: int64

In [16]:
adult_data.isnull().sum()

39                0
 State-gov        0
 77516            0
 Bachelors        0
 13               0
 Never-married    0
 Adm-clerical     0
 Not-in-family    0
 White            0
 Male             0
 2174             0
 0                0
 40               0
 United-States    0
 <=50K            0
dtype: int64